src/Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Comment>Уникальный идентификатор устройства стандарта оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоОтключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДрайверОборудования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДрайверыОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяУстановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКомпоненты</Name>
					<Comment>Версия компоненты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФорматаОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыФорматноЛогическогоКонтроля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыРегистрации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыПодключаемогоОборудования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыПодключаемогоОборудования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>IPТелефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ККТ</Name>
					<Comment>KKT</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПречековыйПринтер</Name>
					<Comment>BeforeCheckPrinters</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СканерШтрихкода</Name>
					<Comment>Scanner</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательМагнитныхКарт</Name>
					<Comment>MSR</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСбораДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФискальныйРегистратор</Name>
					<Comment>FiscalPrinter</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Comment>AcquiringTerminal</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>API</Name>
					<Comment>API</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДисплейПокупателя</Name>
					<Comment>LineDisplay</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчитывательRFID</Name>
					<Comment>RFID</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринтерЧеков</Name>
					<Comment>ReceiptPrinter</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/РабочиеМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>РабочиеМеста</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СетевойПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногопользовательскийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПодключаемоеОборудование/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
// Функция возвращает по идентификатору устройства его параметры
//
Функция ПолучитьПараметрыУстройства(Идентификатор) Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодключаемоеОборудование.Параметры КАК Параметры
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	(ПодключаемоеОборудование.Ссылка = &Идентификатор
	|			ИЛИ ПодключаемоеОборудование.ИдентификаторУстройства = &Идентификатор)");

	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();

	Выборка.Следующий();

	Возврат Выборка.Параметры.Получить();

КонецФункции

// Функция возвращает по идентификатору устройства параметры регистрации.
//
Функция ПолучитьПараметрыРегистрацииУстройства(Идентификатор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодключаемоеОборудование.Ссылка КАК Ссылка,
	|	ПодключаемоеОборудованиеПараметрыРегистрации.НаименованиеПараметра КАК НаименованиеПараметра,
	|	ПодключаемоеОборудованиеПараметрыРегистрации.ЗначениеПараметра КАК ЗначениеПараметра
	|ИЗ
	|	Справочник.ПодключаемоеОборудование.ПараметрыРегистрации КАК ПодключаемоеОборудованиеПараметрыРегистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|		ПО ПодключаемоеОборудованиеПараметрыРегистрации.Ссылка = ПодключаемоеОборудование.Ссылка
	|ГДЕ
	|	(ПодключаемоеОборудование.Ссылка = &Идентификатор
	|			ИЛИ ПодключаемоеОборудование.ИдентификаторУстройства = &Идентификатор)";
	
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЕстьДанные		= Ложь;
	ДанныеХранения 	= Новый Структура;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДанныеХранения.Вставить(ВыборкаДетальныеЗаписи.НаименованиеПараметра, ВыборкаДетальныеЗаписи.ЗначениеПараметра);
		ЕстьДанные = Истина;
	КонецЦикла;
	
	РезультатОперации = МенеджерОборудованияКлиентСервер.ПараметрыРегистрацииККТ();
	РезультатОперации.Вставить("ЕстьДанные", ЕстьДанные);
	
	Если ЕстьДанные Тогда
		РезультатОперации.РегистрационныйНомерККТ = ДанныеХранения.РегистрационныйНомерККТ;
		РезультатОперации.ОрганизацияНазвание     = ДанныеХранения.ОрганизацияНазвание;
		РезультатОперации.ОрганизацияИНН          = ДанныеХранения.ОрганизацияИНН;
		
		Если ДанныеХранения.Свойство("АдресПроведенияРасчетов") Тогда
			РезультатОперации.АдресПроведенияРасчетов = ДанныеХранения.АдресПроведенияРасчетов; 
		КонецЕсли;
		Если ДанныеХранения.Свойство("МестоПроведенияРасчетов") Тогда
			РезультатОперации.МестоПроведенияРасчетов = ДанныеХранения.МестоПроведенияРасчетов; 
		КонецЕсли;
		// для работы со старой версии. в дальнейшем удалить.
		Если ДанныеХранения.Свойство("АдресУстановкиККТ") И НЕ ЗначениеЗаполнено(РезультатОперации.АдресПроведенияРасчетов) Тогда
			РезультатОперации.Вставить("АдресПроведенияРасчетов", ДанныеХранения.АдресУстановкиККТ);
		КонецЕсли;
		
		РезультатОперации.КодыСистемыНалогообложения = ДанныеХранения.КодыСистемыНалогообложения;
		
		Если ДанныеХранения.Свойство("ПризнакАвтономногоРежима") И НЕ ПустаяСтрока(ДанныеХранения.ПризнакАвтономногоРежима) Тогда
			РезультатОперации.ПризнакАвтономногоРежима		= Булево(ДанныеХранения.ПризнакАвтономногоРежима); 
			РезультатОперации.ПризнакАвтоматическогоРежима	= Булево(ДанныеХранения.ПризнакАвтономногоРежима);
		КонецЕсли;
		Если ДанныеХранения.Свойство("ПризнакШифрованиеДанных") И НЕ ПустаяСтрока(ДанныеХранения.ПризнакШифрованиеДанных) Тогда
			РезультатОперации.ПризнакШифрованиеДанных = Булево(ДанныеХранения.ПризнакШифрованиеДанных); 
		КонецЕсли;
		Если ДанныеХранения.Свойство("ПризнакРасчетовЗаУслуги") И НЕ ПустаяСтрока(ДанныеХранения.ПризнакРасчетовЗаУслуги) Тогда
			РезультатОперации.ПризнакАвтономногоРежима = Булево(ДанныеХранения.ПризнакАвтономногоРежима); 
		КонецЕсли;
		Если ДанныеХранения.Свойство("ПризнакФормированияБСО") И НЕ ПустаяСтрока(ДанныеХранения.ПризнакФормированияБСО) Тогда
			РезультатОперации.ПризнакФормированияБСО = Булево(ДанныеХранения.ПризнакФормированияБСО); 
		КонецЕсли;
		Если ДанныеХранения.Свойство("ПризнакРасчетовТолькоВИнтернет") И НЕ ПустаяСтрока(ДанныеХранения.ПризнакРасчетовТолькоВИнтернет) Тогда
			РезультатОперации.ПризнакРасчетовТолькоВИнтернет = Булево(ДанныеХранения.ПризнакРасчетовТолькоВИнтернет); 
		КонецЕсли;
		Если ДанныеХранения.Свойство("ПродажаПодакцизногоТовара") И НЕ ПустаяСтрока(ДанныеХранения.ПродажаПодакцизногоТовара) Тогда
			РезультатОперации.ПродажаПодакцизногоТовара = Булево(ДанныеХранения.ПродажаПодакцизногоТовара); 
		КонецЕсли;
		Если ДанныеХранения.Свойство("ПроведенияАзартныхИгр") И НЕ ПустаяСтрока(ДанныеХранения.ПроведенияАзартныхИгр) Тогда
			РезультатОперации.ПроведенияАзартныхИгр = Булево(ДанныеХранения.ПроведенияАзартныхИгр); 
		КонецЕсли;
		Если ДанныеХранения.Свойство("ПроведенияЛотерей") И НЕ ПустаяСтрока(ДанныеХранения.ПроведенияЛотерей) Тогда
			РезультатОперации.ПроведенияЛотерей = Булево(ДанныеХранения.ПроведенияЛотерей); 
		КонецЕсли;
		Если ДанныеХранения.Свойство("УстановкаПринтераВАвтомате") И НЕ ПустаяСтрока(ДанныеХранения.УстановкаПринтераВАвтомате) Тогда
			РезультатОперации.УстановкаПринтераВАвтомате = Булево(ДанныеХранения.УстановкаПринтераВАвтомате); 
		КонецЕсли;
		
		Если ДанныеХранения.Свойство("ПризнакиАгента") Тогда
			РезультатОперации.ПризнакиАгента = ДанныеХранения.ПризнакиАгента; 
		КонецЕсли;
		
		РезультатОперации.НомерАвтоматаДляАвтоматическогоРежима = ДанныеХранения.НомерАвтоматаДляАвтоматическогоРежима;
		РезультатОперации.ОрганизацияОФДИНН      = ДанныеХранения.ОрганизацияОФДИНН;
		РезультатОперации.ОрганизацияОФДНазвание = ДанныеХранения.ОрганизацияОФДНазвание;
		РезультатОперации.ЗаводскойНомерККТ      = ДанныеХранения.ЗаводскойНомерККТ;
		РезультатОперации.ЗаводскойНомерФН       = ДанныеХранения.ЗаводскойНомерФН;
		РезультатОперации.ВерсияФФДККТ           = ДанныеХранения.ВерсияФФДККТ;
		РезультатОперации.ВерсияФФДФН            = ДанныеХранения.ВерсияФФДФН;
		Если ДанныеХранения.Свойство("ПризнакФискализации") И НЕ ПустаяСтрока(ДанныеХранения.ПризнакФискализации) Тогда
			РезультатОперации.ПризнакФискализации = Булево(ДанныеХранения.ПризнакФискализации); 
		КонецЕсли;
		
		Если ДанныеХранения.Свойство("НомерДокументаФискализации") И ЗначениеЗаполнено(ДанныеХранения.НомерДокументаФискализации) Тогда  
			РезультатОперации.Вставить("НомерДокументаФискализации" , ДанныеХранения.НомерДокументаФискализации);
		КонецЕсли;
		Если ДанныеХранения.Свойство("ДатаВремяФискализации") И ЗначениеЗаполнено(ДанныеХранения.ДатаВремяФискализации) Тогда  
			РезультатОперации.Вставить("ДатаВремяФискализации"		, ДанныеХранения.ДатаВремяФискализации);
		КонецЕсли;

	КонецЕсли;
	
	Возврат РезультатОперации;
	
КонецФункции

// Процедура предназначена для сохранения параметров устройства
// в реквизит Параметры типа хранилище значения в элементе справочника.
//
//
// Возвращаемое значение:
//   Структура
//
Функция СохранитьПараметрыУстройства(Идентификатор, Параметры) Экспорт

	Попытка
		Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодключаемоеОборудование.Ссылка
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|ГДЕ
		|	ПодключаемоеОборудование.Ссылка = &Идентификатор ИЛИ ПодключаемоеОборудование.ИдентификаторУстройства = &Идентификатор");
		
		Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
		ТаблицаРезультатов = Запрос.Выполнить().Выбрать();
		
		Пока ТаблицаРезультатов.Следующий() Цикл
			ОбъектСправочника = ТаблицаРезультатов.Ссылка.ПолучитьОбъект();
			ОбъектСправочника.Параметры = Новый ХранилищеЗначения(Параметры);
			
			Если Параметры.Свойство("ВидТранспортаОфлайнОбмена") Тогда
				ОбъектСправочника.ВидТранспортаОфлайнОбмена = Параметры.ВидТранспортаОфлайнОбмена;
			КонецЕсли;
			
			Если Параметры.Свойство("ИдентификаторWebСервисОборудования") Тогда
				ОбъектСправочника.ИдентификаторWebСервисОборудования = Параметры.ИдентификаторWebСервисОборудования;
			КонецЕсли;
			
			ОбъектСправочника.Записать();
			Результат = Истина;
			
			ОбновитьПовторноИспользуемыеЗначения();
		КонецЦикла;
		
	Исключение
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;

КонецФункции

// Процедура предназначена для сохранения параметров регистрации устройства
//
// Возвращаемое значение:
//   Булево
//
Функция СохранитьПараметрыРегистрацииУстройства(Идентификатор, ПараметрыРегистрации) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Попытка
		Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПодключаемоеОборудование.Ссылка
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|ГДЕ
		|	ПодключаемоеОборудование.Ссылка = &Идентификатор ИЛИ ПодключаемоеОборудование.ИдентификаторУстройства = &Идентификатор");
		
		Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
		ТаблицаРезультатов = Запрос.Выполнить().Выбрать();
		
		Пока ТаблицаРезультатов.Следующий() Цикл
			ОбъектСправочника = ТаблицаРезультатов.Ссылка.ПолучитьОбъект(); // СправочникОбъект.ПодключаемоеОборудование
			ОбъектСправочника.ПараметрыРегистрации.Очистить();
			Для Каждого ПараметрРегистрации Из ПараметрыРегистрации Цикл
				НоваяСтрока = ОбъектСправочника.ПараметрыРегистрации.Добавить();
				НоваяСтрока.НаименованиеПараметра = ПараметрРегистрации.Ключ;
				НоваяСтрока.ЗначениеПараметра = ПараметрРегистрации.Значение;
			КонецЦикла;
			ОбъектСправочника.Записать();
			Результат = Истина;
		КонецЦикла;
		
	Исключение
		Результат = Ложь;
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;

КонецФункции

// Функция возвращает структуру с данными устройства
// (со значениями реквизитов элемента справочника)
Функция ПолучитьДанныеУстройства(Идентификатор) Экспорт

	ДанныеУстройства = Новый Структура();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодключаемоеОборудование.Ссылка КАК Ссылка,
	|	ПодключаемоеОборудование.ИдентификаторУстройства КАК ИдентификаторУстройства,
	|	ПодключаемоеОборудование.Наименование КАК Наименование,
	|	ПодключаемоеОборудование.ТипОборудования КАК ТипОборудования,
	|	ПодключаемоеОборудование.ДрайверОборудования КАК ДрайверОборудования,
	|	ПодключаемоеОборудование.ДрайверОборудования.ИмяПредопределенныхДанных КАК ДрайверОборудованияИмя,
	|	ПодключаемоеОборудование.ДрайверОборудования.Предопределенный КАК ВСоставеКонфигурации,
	|	ПодключаемоеОборудование.ДрайверОборудования.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
	|	ПодключаемоеОборудование.ДрайверОборудования.ПоставляетсяДистрибутивом КАК ПоставляетсяДистрибутивом,
	|	ПодключаемоеОборудование.ДрайверОборудования.ИмяМакетаДрайвера КАК ИмяМакетаДрайвера,
	|	ПодключаемоеОборудование.ДрайверОборудования.ИмяФайлаДрайвера КАК ИмяФайлаДрайвера,
	|	ПодключаемоеОборудование.ДрайверОборудования.ОбработчикДрайвера КАК ОбработчикДрайвера,
	|	ПодключаемоеОборудование.ДрайверОборудования.СнятСПоддержки КАК СнятСПоддержки,
	|	ПодключаемоеОборудование.РабочееМесто КАК РабочееМесто,
	|	ПодключаемоеОборудование.Параметры КАК Параметры,
	|	РабочиеМеста.Код КАК ИмяКомпьютера,
	|	РабочиеМеста.СетевойПорт КАК СетевойПорт,
	|	ПодключаемоеОборудование.ВерсияФорматаОбмена КАК ВерсияФорматаОбмена,
	|	ПодключаемоеОборудование.СерийныйНомер КАК СерийныйНомер
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМеста КАК РабочиеМеста
	|		ПО ПодключаемоеОборудование.РабочееМесто = РабочиеМеста.Ссылка
	|ГДЕ
	|	(ПодключаемоеОборудование.ИдентификаторУстройства = &Идентификатор
	|			ИЛИ ПодключаемоеОборудование.Ссылка = &Идентификатор)");

	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);

	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Следующий() Тогда
		ДанныеУстройства.Вставить("Ссылка"                 		, Выборка.Ссылка);
		ДанныеУстройства.Вставить("ИдентификаторУстройства"		, Выборка.ИдентификаторУстройства);
		ДанныеУстройства.Вставить("Наименование"           		, Выборка.Наименование);
		ДанныеУстройства.Вставить("ТипОборудования"       		, Выборка.ТипОборудования);
		ДанныеУстройства.Вставить("ТипОборудованияИмя"     		, МенеджерОборудованияВызовСервера.ПолучитьИмяТипаОборудования(Выборка.ТипОборудования));
		ДанныеУстройства.Вставить("ДрайверОборудования"    		, Выборка.ДрайверОборудования);
		ДанныеУстройства.Вставить("ДрайверОборудованияИмя" 		, Выборка.ДрайверОборудованияИмя);
		ДанныеУстройства.Вставить("ВСоставеКонфигурации"      	, Выборка.ВСоставеКонфигурации);
		ДанныеУстройства.Вставить("ИдентификаторОбъекта"      	, Выборка.ИдентификаторОбъекта);
		ДанныеУстройства.Вставить("ПоставляетсяДистрибутивом" 	, Выборка.ПоставляетсяДистрибутивом);
		ДанныеУстройства.Вставить("ИмяМакетаДрайвера"         	, Выборка.ИмяМакетаДрайвера);
		ДанныеУстройства.Вставить("ИмяФайлаДрайвера"          	, Выборка.ИмяФайлаДрайвера);
		ДанныеУстройства.Вставить("Параметры"              	 	, Выборка.Параметры.Получить());
		ДанныеУстройства.Вставить("РабочееМесто"           		, Выборка.РабочееМесто);
		ДанныеУстройства.Вставить("СетевойПорт"            		, Выборка.СетевойПорт);
		ДанныеУстройства.Вставить("ИмяКомпьютера"            	, Выборка.ИмяКомпьютера);
		ДанныеУстройства.Вставить("СнятСПоддержки"           	, Выборка.СнятСПоддержки);
		
		ОбработчикДрайвера = Выборка.ОбработчикДрайвера;
		ДанныеУстройства.Вставить("ОбработчикДрайвера"        	, ОбработчикДрайвера);
		ДанныеУстройства.Вставить("ОбработчикДрайвераИмя"     	, XMLСтрока(ОбработчикДрайвера));
		
		ДанныеУстройства.Вставить("ВерсияФорматаОбмена"    		, Выборка.ВерсияФорматаОбмена);
		ДанныеУстройства.Вставить("СерийныйНомер"    	  		, Выборка.СерийныйНомер);		
		ДанныеУстройства.Вставить("АвтоматическаяФискализация"	, Ложь); // Выборка.АвтоматическаяФискализация);
		ДанныеУстройства.Вставить("ИспользуетсяФН36"          	, Ложь); // Выборка.ИспользуетсяФН36); 	
	КонецЕсли;

	Возврат ДанныеУстройства;

КонецФункции

// Функция возвращает список подключенного в справочнике ПО
//
// Параметры:
// 	ТипыПО - Неопределено - Описание
// 	Идентификатор - Неопределено - Описание
// 	РабочееМесто - Неопределено - Описание
//
// Возвращаемое значение:
// 	Массив Из Структура - Описание:
// 	* Наименование - Строка - .
//
Функция ОборудованиеПоПараметрам(
	ТипыПО							 = Неопределено,
	Идентификатор					 = Неопределено, 
	РабочееМесто					 = Неопределено, 
	ТолькоАвтоматическаяФискализация = Ложь) Экспорт

	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПодключаемоеОборудование.Ссылка КАК Ссылка,
	               |	ПодключаемоеОборудование.ИдентификаторУстройства КАК ИдентификаторУстройства,
	               |	ПодключаемоеОборудование.Наименование КАК Наименование,
	               |	ПодключаемоеОборудование.ТипОборудования КАК ТипОборудования,
	               |	ПодключаемоеОборудование.ДрайверОборудования КАК ДрайверОборудования,
	               |	ПодключаемоеОборудование.ДрайверОборудования.ИмяПредопределенныхДанных КАК ДрайверОборудованияИмя,
	               |	ПодключаемоеОборудование.ДрайверОборудования.Предопределенный КАК ВСоставеКонфигурации,
	               |	ПодключаемоеОборудование.ДрайверОборудования.ИдентификаторОбъекта КАК ИдентификаторОбъекта,
	               |	ПодключаемоеОборудование.ДрайверОборудования.ПоставляетсяДистрибутивом КАК ПоставляетсяДистрибутивом,
	               |	ПодключаемоеОборудование.ДрайверОборудования.ИмяМакетаДрайвера КАК ИмяМакетаДрайвера,
	               |	ПодключаемоеОборудование.ДрайверОборудования.ИмяФайлаДрайвера КАК ИмяФайлаДрайвера,
	               |	ПодключаемоеОборудование.ДрайверОборудования.ОбработчикДрайвера КАК ОбработчикДрайвера,
	               |	ПодключаемоеОборудование.ДрайверОборудования.СнятСПоддержки КАК СнятСПоддержки,
	               |	ПодключаемоеОборудование.РабочееМесто КАК РабочееМесто,
	               |	ПодключаемоеОборудование.Параметры КАК Параметры,
	               |	ПодключаемоеОборудование.ПараметрыРегистрации.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		НаименованиеПараметра КАК НаименованиеПараметра,
	               |		ЗначениеПараметра КАК ЗначениеПараметра
	               |	) КАК ПараметрыРегистрации,
	               |	ЛОЖЬ КАК АвтоматическаяФискализация,
	               |	ЛОЖЬ КАК ИспользуетсяФН36,
	               |	РабочиеМеста.Код КАК ИмяКомпьютера
	               |ИЗ
	               |	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РабочиеМеста КАК РабочиеМеста
	               |		ПО (РабочиеМеста.Ссылка = ПодключаемоеОборудование.РабочееМесто)
	               |ГДЕ
	               |	ПодключаемоеОборудование.УстройствоИспользуется" +
		// Добавим в текст запроса условия-фильтры переданные в параметрах вызова.
		?(Идентификатор = Неопределено,
			// Добавим в текст запроса фильтр по типам оборудования (если задан).
		?(ТипыПО <> Неопределено,
		    "
		    |	И (ПодключаемоеОборудование.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка))
		    |	И (ПодключаемоеОборудование.ТипОборудования В (&ТипОборудования))
		    |	И (РабочиеМеста.Ссылка = &РабочееМесто)",
		    "
		    |	И РабочиеМеста.Ссылка = &РабочееМесто"),
			// Добавим в текст запроса фильтр по конкретному устройству (имеет приоритет над другими фильтрами).
		  "
		  |	И (ПодключаемоеОборудование.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка))
		  |	И (ПодключаемоеОборудование.Ссылка = &Идентификатор ИЛИ
		  |	   ПодключаемоеОборудование.ИдентификаторУстройства = &Идентификатор)") +
	"
	|	И (НЕ ПодключаемоеОборудование.ПометкаУдаления)
	|   И Не ПодключаемоеОборудование.ДрайверОборудования.ОбработчикДрайвера = ЗНАЧЕНИЕ(Перечисление.ОбработчикиДрайверовПодключаемогоОборудования.ОбработчикКассовогоСервера)" +
		?(ТолькоАвтоматическаяФискализация, " И (ПодключаемоеОборудование.АвтоматическаяФискализация)", "");
	// Добавим полученное условие отбора к тексту запроса.
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	ТипОборудования,
	|	Наименование;";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	// Установим параметры запроса (фильтрующие выборку значения).
	Если Идентификатор = Неопределено Тогда
		// То используется фильтр по рабочему месту.
		Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
			// Если РМ не задано в параметрах, то всегда текущее из параметров сеанса.
			РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
		КонецЕсли;

		Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
		// И возможно фильтр по типам оборудования.
		Если ТипыПО <> Неопределено Тогда
			// Подготовка перечислений типов ТО для запроса.
			МассивТиповПО = Новый Массив();
			Если ТипЗнч(ТипыПО) = Тип("Структура") Тогда
				Для Каждого ТипПО Из ТипыПО Цикл
					МассивТиповПО.Добавить(Перечисления.ТипыПодключаемогоОборудования[ТипПО.Ключ]);
				КонецЦикла;
				
			ИначеЕсли ТипЗнч(ТипыПО) = Тип("Массив") Тогда
				Для Каждого ТипПО Из ТипыПО Цикл
					МассивТиповПО.Добавить(Перечисления.ТипыПодключаемогоОборудования[ТипПО]);
				КонецЦикла;
				
			Иначе
				МассивТиповПО.Добавить(Перечисления.ТипыПодключаемогоОборудования[ТипыПО]);
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ТипОборудования", МассивТиповПО);
		КонецЕсли;
	Иначе // Фильтр по конкретному устройству.
		Если ТипЗнч(Идентификатор) = Тип("Структура") И Идентификатор.Свойство("ИдентификаторУстройства") Тогда
			Запрос.УстановитьПараметр("Идентификатор", Идентификатор.ИдентификаторУстройства);
		Иначе
			Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
		КонецЕсли;
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();
	
	// Перебирая выборку составляем список устройств.
	СписокОборудования = Новый Массив();
	Пока Выборка.Следующий() Цикл
		// Заполним структуру данных устройства.
		ДанныеУстройства = Новый Структура();
		ДанныеУстройства.Вставить("Ссылка"                    , Выборка.Ссылка);
		ДанныеУстройства.Вставить("ИдентификаторУстройства"   , Выборка.ИдентификаторУстройства);
		ДанныеУстройства.Вставить("Наименование"              , Выборка.Наименование);
		ДанныеУстройства.Вставить("ТипОборудования"           , Выборка.ТипОборудования);
		ДанныеУстройства.Вставить("ТипОборудованияИмя"        , МенеджерОборудованияВызовСервера.ПолучитьИмяТипаОборудования(Выборка.ТипОборудования));
		ДанныеУстройства.Вставить("ДрайверОборудования"       , Выборка.ДрайверОборудования);
		ДанныеУстройства.Вставить("ДрайверОборудованияИмя"    , Выборка.ДрайверОборудованияИмя);
		ДанныеУстройства.Вставить("ВСоставеКонфигурации"      , Выборка.ВСоставеКонфигурации);
		ДанныеУстройства.Вставить("ИдентификаторОбъекта"      , Выборка.ИдентификаторОбъекта);
		ДанныеУстройства.Вставить("ПоставляетсяДистрибутивом" , Выборка.ПоставляетсяДистрибутивом);
		ДанныеУстройства.Вставить("ИмяМакетаДрайвера"         , Выборка.ИмяМакетаДрайвера);
		ДанныеУстройства.Вставить("ИмяФайлаДрайвера"          , Выборка.ИмяФайлаДрайвера);
		ДанныеУстройства.Вставить("Параметры"                 , Выборка.Параметры.Получить());
		ДанныеУстройства.Вставить("РабочееМесто"              , Выборка.РабочееМесто);
		ДанныеУстройства.Вставить("ИмяКомпьютера"             , Выборка.ИмяКомпьютера);
		ОбработчикДрайвера = Выборка.ОбработчикДрайвера;
		ДанныеУстройства.Вставить("ОбработчикДрайвера"        , ОбработчикДрайвера);
		ДанныеУстройства.Вставить("ОбработчикДрайвераИмя"     , XMLСтрока(ОбработчикДрайвера));
		ДанныеУстройства.Вставить("СнятСПоддержки"            , Выборка.СнятСПоддержки);
		
		Если Выборка.ТипОборудования = Перечисления.ТипыПодключаемогоОборудования.ККТ Тогда
			ПараметрыРегистрации = ПолучитьПараметрыРегистрацииУстройства(Выборка.Ссылка);
		Иначе
			ПараметрыРегистрации = Новый Структура();
		КонецЕсли;
		ДанныеУстройства.Вставить("ПараметрыРегистрации"		, ПараметрыРегистрации);
		ДанныеУстройства.Вставить("АвтоматическаяФискализация"	, Выборка.АвтоматическаяФискализация);
		ДанныеУстройства.Вставить("ИспользуетсяФН36"			, Выборка.ИспользуетсяФН36);
	
		Если ТипЗнч(ДанныеУстройства.Параметры) = Тип("Структура") Тогда
			ДанныеУстройства.Параметры.Вставить("Идентификатор"	, Выборка.Ссылка);
		КонецЕсли;
		СписокОборудования.Добавить(ДанныеУстройства);
	КонецЦикла;
	
	// Возвращаем полученный список с данными всех найденных устройств.
	Возврат СписокОборудования;
	
КонецФункции

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Менеджер = "Справочник.ПодключаемоеОборудование";
	МенеджерОборудованияВызовСервераПереопределяемый.ПриЗаполненииОграниченияДоступа(Менеджер, Ограничение);
	
КонецПроцедуры

#Область Хеликс

// Функция возвращает список подключенного в справочнике ВО
//
Функция ПолучитьСписокОборудования(ТипыВО = Неопределено, Идентификатор = Неопределено, РабочееМесто = Неопределено) Экспорт

	// ТекстЗапроса = "
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	ВложенныйЗапрос.Ссылка,
	//|	СпрВнешнееОборудование.ИдентификаторУстройства КАК ИдентификаторУстройства,
	//|	СпрВнешнееОборудование.Наименование КАК Наименование,
	//|	СпрВнешнееОборудование.ТипОборудования КАК ТипОборудования,
	//|	СпрВнешнееОборудование.ОбработчикДрайвера КАК ОбработчикДрайвера,
	//|	СпрВнешнееОборудование.РабочееМесто КАК РабочееМесто,
	//|	СпрРабочихМест.СетевойПорт КАК СетевойПорт
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		ВнешнееОборудование.Ссылка КАК Ссылка
	//|	ИЗ
	//|		Справочник.ВнешнееОборудование КАК ВнешнееОборудование
	//|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РабочиеМеста КАК РабочиеМеста
	//|			ПО (РабочиеМеста.Ссылка = ВнешнееОборудование.РабочееМесто)
	//|	ГДЕ
	//|		(НЕ ВнешнееОборудование.НеИспользовать)
	//|		" + ?(Идентификатор = Неопределено, "И ВнешнееОборудование.РабочееМесто = &РабочееМесто", "") + "
	//|		И (НЕ ВнешнееОборудование.ПометкаУдаления)
	//|
	//|	ОБЪЕДИНИТЬ ВСЕ
	//|
	//|	ВЫБРАТЬ
	//|		ВнешнееОборудованиеПоРабочимМестам.Устройство.Ссылка
	//|	ИЗ
	//|		РегистрСведений.ВнешнееОборудованиеПоРабочимМестам КАК ВнешнееОборудованиеПоРабочимМестам
	//|	ГДЕ
	//|		(НЕ ВнешнееОборудованиеПоРабочимМестам.Устройство.НеИспользовать)
	//|		" + ?(Идентификатор = Неопределено, "И ВнешнееОборудованиеПоРабочимМестам.РабочееМесто = &РабочееМесто", "") + "
	//|		И (НЕ ВнешнееОборудованиеПоРабочимМестам.Устройство.ПометкаУдаления)) КАК ВложенныйЗапрос
	//|
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВнешнееОборудование КАК СпрВнешнееОборудование
	//|		ПО ВложенныйЗапрос.Ссылка = СпрВнешнееОборудование.Ссылка
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.РабочиеМеста КАК СпрРабочихМест
	//|	ПО (СпрВнешнееОборудование.РабочееМесто = СпрРабочихМест.Ссылка)
	//|";

	//// Добавим в текст запроса условия-фильтры переданые в параметрах вызова
	// УсловиеОтбора = "";
	// Если (Идентификатор = Неопределено) Тогда
	//	// Добавим в текст запроса фильтр по типам оборудования (если задан)
	//	Если (ТипыВО <> Неопределено) Тогда
	//		УсловиеОтбора = "
	//		|ГДЕ
	//		|	(СпрВнешнееОборудование.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка)) И
	//		|	(СпрВнешнееОборудование.ТипОборудования В (&ТипОборудования))";
	//	КонецЕсли;
	// Иначе
	//	// Добавим в текст запроса фильтр по конкретному устройству (имеет приоритет над другими фильтрами)
	//	УсловиеОтбора = "
	//	|ГДЕ
	//	|	(СпрВнешнееОборудование.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка)) И
	//	|	(СпрВнешнееОборудование.Ссылка = &Идентификатор ИЛИ
	//	|	 СпрВнешнееОборудование.ИдентификаторУстройства = &Идентификатор)";
	// КонецЕсли;

	//// Добавим полученное условие отбора к тексту запроса
	// ТекстЗапроса = ТекстЗапроса + УсловиеОтбора + "
	//|УПОРЯДОЧИТЬ ПО
	//|	ТипОборудования,
	//|	Наименование;";

	// Запрос = Новый Запрос(ТекстЗапроса);
	//
	//// Установим параметры запроса (фильтрующие выборку значения)
	// Если Идентификатор = Неопределено Тогда
	//	// То используется фильтр по рабочему месту
	//	Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
	//		// Если РМ не задано в параметрах, то всегда текущее из параметров сеанса
	//		РабочееМесто = МенеджерОборудованияСервер.ПолучитьРабочееМестоКлиента();
	//	КонецЕсли;

	//	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	//	// И возможно фильтр по типам оборудования
	//	Если ТипыВО <> Неопределено Тогда
	//		// Подготовка перечислений типов ТО для запроса
	//		МассивТиповВО = Новый Массив();
	//		Если ТипЗнч(ТипыВО) = Тип("Структура") Тогда
	//			Для Каждого ТипВО Из ТипыВО Цикл
	//				МассивТиповВО.Добавить(Перечисления.ТипыВнешнегоОборудования[ТипВО.Ключ]);
	//			КонецЦикла;

	//		ИначеЕсли ТипЗнч(ТипыВО) = Тип("Массив") Тогда
	//			Для Каждого ТипВО Из ТипыВО Цикл
	//				МассивТиповВО.Добавить(Перечисления.ТипыВнешнегоОборудования[ТипВО]);
	//			КонецЦикла;

	//		Иначе
	//			МассивТиповВО.Добавить(Перечисления.ТипыВнешнегоОборудования[ТипыВО]);
	//		КонецЕсли;

	//		Запрос.УстановитьПараметр("ТипОборудования", МассивТиповВО);
	//	КонецЕсли;
	// Иначе // Фильтр по конкретному устройству
	//	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	// КонецЕсли;

	// Выборка = Запрос.Выполнить().Выбрать();

	//// Перебирая выборку составляем список устройств
	// СписокОборудования = Новый Массив();
	// Пока Выборка.Следующий() Цикл
	//	// Заполним структуру данных очередного устройства
	//	ДанныеУстройства = Новый Структура();
	//	ДанныеУстройства.Вставить("Ссылка"                 , Выборка.Ссылка);
	//	ДанныеУстройства.Вставить("ИдентификаторУстройства", Выборка.ИдентификаторУстройства);
	//	ДанныеУстройства.Вставить("Наименование"           , Выборка.Наименование);
	//	ДанныеУстройства.Вставить("ТипОборудования"        , Выборка.ТипОборудования);
	//	ДанныеУстройства.Вставить("ТипОборудованияИмя"     , МенеджерОборудованияСервер.ПолучитьИмяТипаОборудования(Выборка.ТипОборудования));
	//	ДанныеУстройства.Вставить("ОбработчикДрайвера"     , Выборка.ОбработчикДрайвера);
	//	ДанныеУстройства.Вставить("РабочееМесто"           , Выборка.РабочееМесто);
	//	ДанныеУстройства.Вставить("СетевойПорт"            , Выборка.СетевойПорт);
	//	ДанныеУстройства.Вставить("ИмяКомпьютера"          , Выборка.РабочееМесто.Код);
	//	// ДанныеУстройства.Вставить("Параметры"              , Выборка.Ссылка.Параметры.Получить());
	//	
	//	ПараметрыРегистрации = Новый Структура();
	//	Для Каждого СтрокаТЧ из Выборка.Ссылка.ПараметрыРегистрации Цикл
	//		ПараметрыРегистрации.Вставить(СтрокаТЧ.НаименованиеПараметра, СтрокаТЧ.ЗначениеПараметра);		
	//	КонецЦикла;
	//	ДанныеУстройства.Вставить("ПараметрыРегистрации", ПараметрыРегистрации);		
	//	СписокОборудования.Добавить(ДанныеУстройства);		
	// КонецЦикла;

	//// Возвращаем полученный список с данными всех найденных устройств
	// Возврат СписокОборудования;

	// 
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ПодключаемоеОборудование.Ссылка КАК Ссылка,
	|	ПодключаемоеОборудование.ИдентификаторУстройства КАК ИдентификаторУстройства,
	|	ПодключаемоеОборудование.Наименование КАК Наименование,
	|	ПодключаемоеОборудование.ТипОборудования КАК ТипОборудования,
	|	ПодключаемоеОборудование.ДрайверОборудования КАК ДрайверОборудования,
	|	ПодключаемоеОборудование.ДрайверОборудования.СнятСПоддержки КАК СнятСПоддержки,
	|	ПодключаемоеОборудование.ВерсияФорматаОбмена КАК ВерсияФорматаОбмена,
	|	ПодключаемоеОборудование.РабочееМесто КАК РабочееМесто,
	|	ПодключаемоеОборудование.Параметры КАК Параметры,
	|	ПодключаемоеОборудование.УстройствоИспользуется КАК УстройствоИспользуется,
	|	ПодключаемоеОборудование.ПараметрыРегистрации.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		НаименованиеПараметра КАК НаименованиеПараметра,
	|		ЗначениеПараметра КАК ЗначениеПараметра
	|	) КАК ПараметрыРегистрации,
	|	РабочиеМеста.ИмяКомпьютера КАК ИмяКомпьютера
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РабочиеМеста КАК РабочиеМеста
	|		ПО (РабочиеМеста.Ссылка = ПодключаемоеОборудование.РабочееМесто)
	|ГДЕ
	|	НЕ ПодключаемоеОборудование.УстройствоОтключено" +
	// Добавим в текст запроса условия-фильтры переданные в параметрах вызова.
	?(Идентификатор = Неопределено,
	// Добавим в текст запроса фильтр по типам оборудования (если задан).
	?(ТипыВО <> Неопределено,
	"
	|	И (ПодключаемоеОборудование.ТипОборудования В (&ТипОборудования))
	|	И ВЫБОР КОГДА ПодключаемоеОборудование.ТипОборудования В (ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.IPТелефония))
	|		ТОГДА ИСТИНА
	|   КОГДА ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ККТ) И (ПодключаемоеОборудование.ДрайверОборудования.ИмяПредопределенныхДанных = ""ДрайверLifePayККТ54ФЗ"" 
	|   Или ПодключаемоеОборудование.ДрайверОборудования.ИмяПредопределенныхДанных = ""ДрайверЭвоторККТ54ФЗ"") Тогда Истина 
	|	ИНАЧЕ (ПодключаемоеОборудование.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка))
	|				И (РабочиеМеста.Ссылка = &РабочееМесто)
	|	КОНЕЦ",
	"
	|	И РабочиеМеста.Ссылка = &РабочееМесто"),
	// Добавим в текст запроса фильтр по конкретному устройству (имеет приоритет над другими фильтрами).
	"
	|	И ВЫБОР КОГДА ПодключаемоеОборудование.ТипОборудования В (ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.IPТелефония)) 
	|		ТОГДА ИСТИНА
	|   КОГДА ПодключаемоеОборудование.ТипОборудования = ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ККТ) И (ПодключаемоеОборудование.ДрайверОборудования.ИмяПредопределенныхДанных = ""ДрайверLifePayККТ54ФЗ"" 
	|   Или ПодключаемоеОборудование.ДрайверОборудования.ИмяПредопределенныхДанных = ""ДрайверЭвоторККТ54ФЗ"") Тогда Истина 
	|		ИНАЧЕ ПодключаемоеОборудование.РабочееМесто <> ЗНАЧЕНИЕ(Справочник.РабочиеМеста.ПустаяСсылка)
	|	  КОНЕЦ
	|	И (ПодключаемоеОборудование.Ссылка = &Идентификатор ИЛИ
	|	   ПодключаемоеОборудование.ИдентификаторУстройства = &Идентификатор)") +
	"
	|	И (НЕ ПодключаемоеОборудование.ПометкаУдаления)";
	
	// Добавим полученное условие отбора к тексту запроса.
	ТекстЗапроса = ТекстЗапроса + "
	|УПОРЯДОЧИТЬ ПО
	|	ТипОборудования,
	|	Наименование;";

	Запрос = Новый Запрос(ТекстЗапроса);
	
	// Установим параметры запроса (фильтрующие выборку значения).
	Если Идентификатор = Неопределено Тогда
		// То используется фильтр по рабочему месту.
		Если НЕ ЗначениеЗаполнено(РабочееМесто) Тогда
			// Если РМ не задано в параметрах, то всегда текущее из параметров сеанса.
			РабочееМесто = МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();
		КонецЕсли;

		Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
		// И возможно фильтр по типам оборудования.
		Если ТипыВО <> Неопределено Тогда
			// Подготовка перечислений типов ТО для запроса.
			МассивТиповПО = Новый Массив();
			Если ТипЗнч(ТипыВО) = Тип("Структура") Тогда
				Для Каждого ТипПО Из ТипыВО Цикл
					МассивТиповПО.Добавить(Перечисления.ТипыПодключаемогоОборудования[ТипПО.Ключ]);
				КонецЦикла;
				
			ИначеЕсли ТипЗнч(ТипыВО) = Тип("Массив") Тогда
				Для Каждого ТипПО Из ТипыВО Цикл
					МассивТиповПО.Добавить(Перечисления.ТипыПодключаемогоОборудования[ТипПО]);
				КонецЦикла;
				
			Иначе
				МассивТиповПО.Добавить(Перечисления.ТипыПодключаемогоОборудования[ТипыВО]);
			КонецЕсли;
			
			Запрос.УстановитьПараметр("ТипОборудования", МассивТиповПО);
		КонецЕсли;
	Иначе // Фильтр по конкретному устройству.
		Если ТипЗнч(Идентификатор) = Тип("Структура") И Идентификатор.Свойство("ИдентификаторУстройства") Тогда
			Запрос.УстановитьПараметр("Идентификатор", Идентификатор.ИдентификаторУстройства);
		Иначе
			Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
		КонецЕсли;
	КонецЕсли;

	Выборка = Запрос.Выполнить().Выбрать();
	
	// Перебирая выборку составляем список устройств.
	СписокОборудования = Новый Массив();
	Пока Выборка.Следующий() Цикл
		// Заполним структуру данных устройства.
		ДанныеУстройства = Новый Структура();
		ДанныеУстройства.Вставить("Ссылка"                    , Выборка.Ссылка);
		
		ДанныеУстройства.Вставить("ИдентификаторУстройства"   , Выборка.ИдентификаторУстройства);
		ДанныеУстройства.Вставить("Наименование"              , Выборка.Наименование);
		ДанныеУстройства.Вставить("ТипОборудования"           , Выборка.ТипОборудования);
		ДанныеУстройства.Вставить("ТипОборудованияИмя"        , МенеджерОборудованияВызовСервера.ПолучитьИмяТипаОборудования(Выборка.ТипОборудования));
		ДанныеУстройства.Вставить("ДрайверОборудования"       , Выборка.ДрайверОборудования);
		ДанныеУстройства.Вставить("ДрайверОборудованияИмя"    , Выборка.ДрайверОборудования.ИмяПредопределенныхДанных);
		ДанныеУстройства.Вставить("ВСоставеКонфигурации"      , Выборка.ДрайверОборудования.Предопределенный);
		ДанныеУстройства.Вставить("ИдентификаторОбъекта"      , Выборка.ДрайверОборудования.ИдентификаторОбъекта);
		ДанныеУстройства.Вставить("ПоставляетсяДистрибутивом" , Выборка.ДрайверОборудования.ПоставляетсяДистрибутивом);
		ДанныеУстройства.Вставить("ИмяМакетаДрайвера"         , Выборка.ДрайверОборудования.ИмяМакетаДрайвера);
		ДанныеУстройства.Вставить("ИмяФайлаДрайвера"          , Выборка.ДрайверОборудования.ИмяФайлаДрайвера);
		ДанныеУстройства.Вставить("Параметры"                 , Выборка.Параметры.Получить());
		ДанныеУстройства.Вставить("РабочееМесто"              , Выборка.РабочееМесто);
		ДанныеУстройства.Вставить("УстройствоИспользуется"    , Выборка.УстройствоИспользуется);
		ДанныеУстройства.Вставить("ИмяКомпьютера"             , Выборка.ИмяКомпьютера);
		ОбработчикДрайвера = Выборка.ДрайверОборудования.ОбработчикДрайвера;
		ДанныеУстройства.Вставить("ОбработчикДрайвера"        , ОбработчикДрайвера);
		ДанныеУстройства.Вставить("ОбработчикДрайвераИмя"     , XMLСтрока(ОбработчикДрайвера));		
		
		ВерсияФорматаОбмена = ?(Выборка.ВерсияФорматаОбмена > 0, Выборка.ВерсияФорматаОбмена, МенеджерОборудованияВызовСервера.РевизияИнтерфейсаДрайверов()); 
		ДанныеУстройства.Вставить("ВерсияФорматаОбмена", ВерсияФорматаОбмена);
		
		ПараметрыРегистрации = Новый Структура();
		ВыбПарРегистрации = Выборка.ПараметрыРегистрации.Выбрать();
		Пока ВыбПарРегистрации.Следующий() Цикл
			ПараметрыРегистрации.Вставить(ВыбПарРегистрации.НаименованиеПараметра, ВыбПарРегистрации.ЗначениеПараметра);
		КонецЦикла;
		ДанныеУстройства.Вставить("ПараметрыРегистрации"     , ПараметрыРегистрации);
		
		Если ТипЗнч(ДанныеУстройства.Параметры) = Тип("Структура") Тогда
			ДанныеУстройства.Параметры.Вставить("Идентификатор", Выборка.Ссылка); 
		КонецЕсли;
		ДанныеУстройства.Вставить("СнятСПоддержки"     		 , Выборка.СнятСПоддержки);

		СписокОборудования.Добавить(ДанныеУстройства);
	КонецЦикла;
	
	// Возвращаем полученный список с данными всех найденных устройств.
	Возврат СписокОборудования;

КонецФункции

// Функция, возвращает структуру параметров внешнего оборудования
//
Функция ПолучитьСведенияОВнешнемОборудовании(ВнешнееОборудование) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПодключаемоеОборудование.Параметры КАК Параметры
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.УстройствоОтключено = ЛОЖЬ
	|	И ПодключаемоеОборудование.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка", ВнешнееОборудование);			   
	Результат = Запрос.Выполнить().Выбрать();	
	
	Если Результат.Следующий() Тогда		
		Возврат Результат.Параметры.Получить();
	Иначе Возврат Неопределено;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

// Функция - Получить массив фр ик КТ
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьМассивФрИкКТ() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПодключаемоеОборудование.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
	|ГДЕ
	|	ПодключаемоеОборудование.УстройствоИспользуется = ИСТИНА
	|	И ПодключаемоеОборудование.ПометкаУдаления = ЛОЖЬ
	|	И ПодключаемоеОборудование.ТипОборудования В (ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ФискальныйРегистратор), ЗНАЧЕНИЕ(Перечисление.ТипыПодключаемогоОборудования.ККТ))
	|	И ПодключаемоеОборудование.ДрайверОборудования.ИмяПредопределенныхДанных <> ""ДрайверКассовогоСервера""");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
КонецФункции

#КонецОбласти
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецЕсли

#КонецОбласти
